<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\University;
use App\Models\Faculty;

class UniversityFacultySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            'جامعة القاهرة' => ['الهندسة', 'الطب', 'التجارة', 'الحاسبات والذكاء الاصطناعي', 'الآداب', 'الحقوق'],
            'جامعة عين شمس' => ['الهندسة', 'الطب', 'التجارة', 'الحاسبات والمعلومات', 'الألسن', 'العلوم'],
            'جامعة الإسكندرية' => ['الهندسة', 'الطب', 'التجارة', 'العلوم', 'الآداب'],
            'جامعة المنصورة' => ['الهندسة', 'الطب', 'الحاسبات والمعلومات', 'الزراعة'],
            'جامعة أسيوط' => ['الهندسة', 'الطب', 'العلوم', 'الآداب'],
            'جامعة حلوان' => ['الهندسة', 'الفنون الجميلة', 'الفنون التطبيقية', 'التجارة', 'الحاسبات والذكاء الاصطناعي'],
            'جامعة طنطا' => ['الطب', 'التجارة', 'التربية', 'العلوم'],
            'جامعة الزقازيق' => ['الطب', 'الهندسة', 'الزراعة', 'التربية'],
            'الجامعة البريطانية في مصر' => ['الهندسة', 'نظم المعلومات', 'إدارة الأعمال', 'طب الأسنان'],
            'الجامعة الألمانية بالقاهرة' => ['الهندسة', 'الإدارة', 'الصيدلة', 'الفنون التطبيقية'],
            'الجامعة الأمريكية بالقاهرة' => ['الهندسة', 'إدارة الأعمال', 'العلوم الإنسانية', 'الشؤون الدولية'],
        ];

        foreach ($data as $universityName => $faculties) {
            $university = University::create(['name' => $universityName]);
            foreach ($faculties as $facultyName) {
                Faculty::create([
                    'name' => $facultyName,
                    'university_id' => $university->id
                ]);
            }
        }
    }
}
